Documents/ИсполнениеРешенияОбИзмененииУставногоКапиталаООО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИсполнениеРешенияОбИзмененииУставногоКапиталаООО</Name>
			<BasedOn>
				<xr:Item>Document.РешениеОбИзмененииУставногоКапиталаООО</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>InformationRegister.СостоянияРешенийОбИзмененияхУставныхКапиталовООО</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоЦеннымБумагам</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумаг</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Доли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РешениеОбИзмененииУставногоКапиталаООО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияСведений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦенныхБумаг</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗадолженностиПоЦеннымБумагам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоЦеннымБумагам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоЦеннымБумагам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ОперацииСЦеннымиБумагами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОперацииСЦеннымиБумагами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПокупки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоставкиПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПроцент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогашениеКупона</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыводЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсполнениеРешенияОбИзмененииУставногоКапиталаООО</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету</v8:Type>
						<v8:Type>cfg:DocumentRef.РеклассификацияАктивовЕПС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоставкаЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦеннойБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.СнятиеЦеннойБумагиСУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеСписаниеРезервов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсполнениеОбязательствПоСделке</v8:Type>
						<v8:Type>cfg:DocumentRef.Маржа</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеЦеннойБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеУсловийСделки</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаСделки</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСделкиРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогашениеКупона</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦеннойБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсполнениеОбязательствПоСделке</v8:Type>
						<v8:Type>cfg:DocumentRef.Маржа</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияПоручений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноИсполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИсполнениеРешенияОбИзмененииУставногоКапиталаООО/Ext/ObjectModule.bsl
Процедура УстановитьБлокировки()
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиЦенныхБумаг");
	
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  	ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Рынок",  						Перечисления.РынкиЦенныхБумаг.Доли);
	ЭлементБлокировкиДанных.УстановитьЗначение("ЦеннаяБумага",  				ЭтотОбъект.Доля);
	
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ЗадолженностиПоЦеннымБумагам");

	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  	ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Основание",  					ЭтотОбъект.Основание);
	ЭлементБлокировкиДанных.УстановитьЗначение("ВидЗадолженности",  			Справочники.ВидыЗадолженности.ПоВкладуВУставныйКапиталООО);
	ЭлементБлокировкиДанных.УстановитьЗначение("Рынок",  						Перечисления.РынкиЦенныхБумаг.Доли);
	ЭлементБлокировкиДанных.УстановитьЗначение("ЦеннаяБумага",  				ЭтотОбъект.Доля);
	
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры

Функция ПолучитьТекущийРазмерДоли()
	
	//проверим изменился ли размер доли
	ТекущийРазмерДоли = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&Дата,
		|			Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли)
		|				И ЦеннаяБумага = &ЦеннаяБумага
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиЦенныхБумагОстатки";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЭтотОбъект.Доля);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ТекущийРазмерДоли = ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЕсли;
	
	Возврат ТекущийРазмерДоли;
	
КонецФункции

Процедура СформироватьДвиженияПоОперациямСЦеннымиБумагами(ТекущийРазмерДоли)
	
	Если ЭтотОбъект.Основание.СуммаОплаты <> 0
		ИЛИ ТекущийРазмерДоли < ЭтотОбъект.Основание.РазмерДолиПослеИзменения Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсполнениеРешенияОбИзмененииУставногоКапиталаООО.Ссылка КАК Операция,
			|	ВЫБОР
			|		КОГДА &ТекущийРазмерДоли <= РешениеОбИзмененииУставногоКапиталаООО.РазмерДолиПослеИзменения
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
			|		КОГДА &ТекущийРазмерДоли > РешениеОбИзмененииУставногоКапиталаООО.РазмерДолиПослеИзменения
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
			|	КОНЕЦ КАК ВидДвижения,
			|	ИсполнениеРешенияОбИзмененииУставногоКапиталаООО.Организация КАК Организация,
			|	ИсполнениеРешенияОбИзмененииУставногоКапиталаООО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Доли) КАК Рынок,
			|	ИсполнениеРешенияОбИзмененииУставногоКапиталаООО.Доля.ВалютаНоминала КАК Валюта,
			|	ИсполнениеРешенияОбИзмененииУставногоКапиталаООО.Доля КАК ЦеннаяБумага,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПоставкиПлановая,
			|	ИсполнениеРешенияОбИзмененииУставногоКапиталаООО.Дата КАК ДатаПоставки,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОплатыПлановая,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОплаты,
			|	РешениеОбИзмененииУставногоКапиталаООО.РазмерДолиПослеИзменения - &ТекущийРазмерДоли КАК Количество,
			|	0 КАК Цена,
			|	0 КАК ЦенаПроцент,
			|	0 КАК ЦенаКупона,
			|	РешениеОбИзмененииУставногоКапиталаООО.СуммаОплаты КАК Сумма,
			|	0 КАК СуммаКупона,
			|	ИсполнениеРешенияОбИзмененииУставногоКапиталаООО.Дата КАК ДатаОперации
			|ИЗ
			|	Документ.ИсполнениеРешенияОбИзмененииУставногоКапиталаООО КАК ИсполнениеРешенияОбИзмененииУставногоКапиталаООО
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РешениеОбИзмененииУставногоКапиталаООО КАК РешениеОбИзмененииУставногоКапиталаООО
			|		ПО ИсполнениеРешенияОбИзмененииУставногоКапиталаООО.Основание = РешениеОбИзмененииУставногоКапиталаООО.Ссылка
			|ГДЕ
			|	ИсполнениеРешенияОбИзмененииУставногоКапиталаООО.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("ТекущийРазмерДоли", ТекущийРазмерДоли);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Движения.ОперацииСЦеннымиБумагами.Добавить(), Выборка);
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры // СформироватьДвиженияПоОперациямСЦеннымиБумагами

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.СостоянияРешенийОбИзмененияхУставныхКапиталовООО.Записывать  = Истина;
	Движения.ОстаткиЦенныхБумаг.Записывать  = Истина;
	Движения.ЗадолженностиПоЦеннымБумагам.Записывать  = Истина;
	Движения.ОперацииСЦеннымиБумагами.Записывать         	= Истина;
	
	Движение = Движения.СостоянияРешенийОбИзмененияхУставныхКапиталовООО.Добавить();
	Движение.Период 								= ЭтотОбъект.Дата;
	Движение.Организация 							= ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления 			= ЭтотОбъект.СчетДоверительногоУправления;
	Движение.РешениеОбИзмененииУставногоКапитала 	= ЭтотОбъект.Основание;
	Движение.Состояние 								= Перечисления.СостоянияПоручений.Исполнено;
	
	ТекущийРазмерДоли = ПолучитьТекущийРазмерДоли();
	
	Если ТекущийРазмерДоли <> ЭтотОбъект.Основание.РазмерДолиПослеИзменения  Тогда
		
		ИзменениеДоли = ЭтотОбъект.Основание.РазмерДолиПослеИзменения - ТекущийРазмерДоли;
		
		Если ИзменениеДоли > 0 Тогда
			Движение = Движения.ОстаткиЦенныхБумаг.ДобавитьПриход();	
		Иначе
			Движение = Движения.ОстаткиЦенныхБумаг.ДобавитьРасход();	
		КонецЕсли;
		
		Движение.Период 						= ЭтотОбъект.Дата;
		Движение.Организация 					= ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления 	= ЭтотОбъект.СчетДоверительногоУправления;
		Движение.ДепозитарныйСчет               = Справочники.ДепозитарныеСчета.СчетУчетаДолей;
		Движение.Рынок                          = Перечисления.РынкиЦенныхБумаг.Доли;
		Движение.ЦеннаяБумага                   = ЭтотОбъект.Доля;
		
		Движение.Количество 					= МатематическиеФункции.МодульЧисла(ИзменениеДоли);
		
		
		Движение = Движения.ЗадолженностиПоЦеннымБумагам.ДобавитьРасход();	
		
		Движение.Период 						= ЭтотОбъект.Дата;
		Движение.Организация 					= ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления 	= ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Основание               		= ЭтотОбъект.Основание;
		Движение.ТипЗадолженности 				= ?(ИзменениеДоли > 0, Перечисления.ТипыЗадолженности.Дебиторская, Перечисления.ТипыЗадолженности.Кредиторская);
		Движение.ВидЗадолженности 				= Справочники.ВидыЗадолженности.ПоВкладуВУставныйКапиталООО;
		Движение.Рынок                   		= Перечисления.РынкиЦенныхБумаг.Доли;
		Движение.ЦеннаяБумага                   = ЭтотОбъект.Доля;
		Движение.Валюта                   		= ЭтотОбъект.Доля.ВалютаНоминала;
		
		Движение.Количество 					= МатематическиеФункции.МодульЧисла(ИзменениеДоли);
		
		РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиЦенныхБумаг(ЭтотОбъект, Отказ);
		РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиЗадолженностиПоЦеннымБумагам(ЭтотОбъект, Отказ);
		
	КонецЕсли;
	
	СформироватьДвиженияПоОперациямСЦеннымиБумагами(ТекущийРазмерДоли);
		
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса


Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт

КонецПроцедуры
	
Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	НастройкиПоВидуУчета = БухгалтерскийУчет.ОпределитьНастройкиПоВидуУчета(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		УчетныйРегистр,
		Отказ);
		
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Отсутствуют настройки у %1 по виду учета %2 на %3!", ЭтотОбъект.СчетДоверительногоУправления, УчетныйРегистр, ЭтотОбъект.Дата));
		Возврат;
	КонецЕсли;
		
	СчетРасчетовСКонтрагентами		= ПланыСчетов.Основной.РасчетыСПрочимиПоставщикамиИПодрядчиками;
	Контрагент = ЭтотОбъект.Доля.ЮрЛицо;
	
	ВидСубконтоУчетаЦеннойБумаги = ПланыВидовХарактеристик.ВидыСубконто.Доли;	
	
	УчетныйАктив       = Справочники.УчетныеАктивы.Доли;
	
	СчетУчета = БухгалтерскийУчет.ОпределитьСчетУчетаАктивов(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		УчетныйАктив,
		УчетныйРегистр);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(БухПартииЦенныхБумаг.Количество) КАК Количество,
		|	БухПартииЦенныхБумаг.ВидДвижения КАК ВидДвижения,
		|	СУММА(БухПартииЦенныхБумаг.Стоимость) КАК Стоимость,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	БухПартииЦенныхБумаг.ЦеннаяБумага,
		|	БухПартииЦенныхБумаг.ВидДвижения";

	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидУчета",    Перечисления.ВидыУчета[УчетныйРегистр]);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "НалоговыйУчет", УчетныйРегистр);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		
			
		Если Выборка.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			
			СтоимостьПокупки = Выборка.Стоимость;
			СтоимостьПокупкиВВалютеУчета = Выборка.СтоимостьВВалютеУчета;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СтоимостьПокупкиВВалютеУчета, "Взнос в уставный капитал");
			
			// дебет
			Проводка.СчетДт = СчетУчета;
			Проводка.СубконтоДт[ВидСубконтоУчетаЦеннойБумаги] = Доля;
			
			Проводка.КоличествоДт = Выборка.Количество;
			
			// кредит
			Проводка.СчетКт = СчетРасчетовСКонтрагентами;
			Проводка.СубконтоКт.Контрагенты = Контрагент;
			
		ИначеЕсли Выборка.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
			
			// СПИСЫВАЕМ СЕБЕСТОИМОСТЬ ПРОДАННОЙ БУМАГИ В РАСХОДЫ
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], Выборка.СтоимостьВВалютеУчета, "Уменьшение уставного капитала");
			
			// дебет
			Проводка.СчетДт = СчетРасчетовСКонтрагентами;
			Проводка.СубконтоДт.Контрагенты = Контрагент;
			
			// кредит
			Проводка.СчетКт = СчетУчета;
			Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = Доля;
			
			Проводка.КоличествоКт = Выборка.Количество;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОсновании(ДокументОснование)
		
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РешениеОбИзмененииУставногоКапиталаООО") Тогда
	
		Организация = ДокументОснование.Организация;
		СчетДоверительногоУправления = ДокументОснование.СчетДоверительногоУправления;
		Основание = ДокументОснование.Ссылка;
		Доля = ДокументОснование.Доля;
	
	КонецЕсли; 

КонецПроцедуры // ЗаполнитьДокументНаОсновании



#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РешениеОбИзмененииУставногоКапиталаООО") Тогда // ввод на основании
		ЗаполнитьДокументНаОсновании(ДанныеЗаполнения);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
	
		Если ЭтотОбъект.Дата < ЭтотОбъект.ДатаРеестра Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата документа не может быть раньше даты реестра!'"), ЭтотОбъект, "ДатаРеестра",, Отказ);
		КонецЕсли;
		
		Если НачалоДня(ЭтотОбъект.Дата) <> ЭтотОбъект.ДатаРеестра И НачалоДня(ЭтотОбъект.Дата) <> ЭтотОбъект.ДатаПолученияСведений Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата документа должна совпадать с датой реестра или с датой получения сведений!'"), ЭтотОбъект, "ДатаРешения",, Отказ);
		КонецЕсли;
		
		Если ЭтотОбъект.Дата < ЭтотОбъект.Основание.Дата Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата документа не может быть раньше даты решения об изменении уставного капитала!'"), ЭтотОбъект, "ДатаРеестра",, Отказ);
		КонецЕсли;
		
		Если Основание.Доля <> Доля Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='В исполнении выбрано решение для другой доли!'"), ЭтотОбъект, "ДатаРешения",, Отказ);
		КонецЕсли;
		
		Если Основание.СчетДоверительногоУправления <> СчетДоверительногоУправления Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='В исполнении выбрано решение для другого счета доверительного управления!'"), ЭтотОбъект, "ДатаРешения",, Отказ);
		КонецЕсли;
		
		//проверим размер уставного капитала в регистре
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УставнойКапиталСрезПоследних.РазмерУставногоКапитала КАК РазмерУставногоКапитала
			|ИЗ
			|	РегистрСведений.УставнойКапитал.СрезПоследних(&Дата, ЮрЛицо = &ЮрЛицо) КАК УставнойКапиталСрезПоследних";
		
		Запрос.УстановитьПараметр("Дата", ЭтотОбъект.ДатаРеестра);
		Запрос.УстановитьПараметр("ЮрЛицо", ЭтотОбъект.Доля.ЮрЛицо);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.РазмерУставногоКапитала <> ЭтотОбъект.Основание.СуммаУставногоКапиталаПослеИзменения Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Размер уставного капитала в регистре на дату реестра не соответствует исполненному решению!'"), ЭтотОбъект, "ДатаРешения",, Отказ);
			КонецЕсли;
		КонецЦикла;
		
		//Проверим что решение требует исполнения
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СостоянияРешенийОбИзмененияхУставныхКапиталовОООСрезПоследних.Состояние КАК Состояние
			|ИЗ
			|	РегистрСведений.СостоянияРешенийОбИзмененияхУставныхКапиталовООО.СрезПоследних(
			|			&МоментВремени,
			|			РешениеОбИзмененииУставногоКапитала = &РешениеОбИзмененииУставногоКапитала
			|				И Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК СостоянияРешенийОбИзмененияхУставныхКапиталовОООСрезПоследних";
		
		Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("РешениеОбИзмененииУставногоКапитала", ЭтотОбъект.Основание);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Решение об изменении уставного капитала "+ЭтотОбъект.Доля+" не зарегистрировано!'"), ЭтотОбъект, "Основание",, Отказ);
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Состояние <> Перечисления.СостоянияПоручений.ПустаяСсылка() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Решение об изменении уставного капитала  не требует исполнения!'"), ЭтотОбъект, ,, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);

КонецПроцедуры

#КонецОбласти
